#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Spriteset_UI.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AA.Spriteset_UI::

    _._createTargetUI = ->
        #TODO: А если не активен?
        @sTargetInfo = new AA.UISet_TargetInfo(@)
        @_registerUISet(@sTargetInfo) ## Spriteset_UI_0
    
    
    return
# ■ END Spriteset_UI.coffee
#---------------------------------------------------------------------------