#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Actor.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Actor::

    #$[OVER]
    _.getAASkills = ->
        # * Включает атаку и защиту (базовые 1 и 2)
        #TODO: навык защиты надо тоже под АБС автоматически дорабатывать при загрузке
        list = @skills().concat([$dataSkills[1], $dataSkills[2]])
        return list.filter (skill) -> skill.AASkill?
    
    
    return
# ■ END Game_Actor.coffee
#---------------------------------------------------------------------------