# * Основной класс менеджер интерфейса (API)

AA.UI = ->

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ AA.UI.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AA.UI

    _.setUI = (@uiSet) ->

    # * Когда появляется окно с сообщением
    _.onGameMessageStart = ->
        @uiSet?.onGameMessageStart()

    # * Когда заканчивается окно с сообщением
    _.onGameMessageEnd = ->
        @uiSet?.onGameMessageEnd()

    # * Когда было нажатие мышки на какой-либо UI элемент
    _.IsUITouched = -> false

    # * Основной интерфейс Spriteset_UI
    # -----------------------------------------------------------------------
    do ->

        _.refreshElement = (tag) ->
            @uiSet?.refreshElement(tag)

        _.hide = -> @uiSet?.hide()

        _.show = -> @uiSet?.show()

    # -----------------------------------------------------------------------

    # * Цель игрока
    # -----------------------------------------------------------------------
    do ->
        # * Круг под выбранной целью
        _.setSelectedCircle = (@selectedCircle) ->

        _.selectTargetOnMap = (char) -> @selectedCircle?.setTarget char

        _.resetTargetSelection = -> _.selectTargetOnMap(null)

    # -----------------------------------------------------------------------

    return
# ■ END AA.UI.coffee
#---------------------------------------------------------------------------

