#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Troop.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    # * Через класс Game_Troop мы будем обращаться ко всем АБС врагам (АИ) на карте

    #@[DEFINES]
    _ = Game_Troop::

    # * Активирует ABS для всех событий на карте
    _.initABS = ->
        $gameMap.initABS()

    
    return
# ■ END Game_Troop.coffee
#---------------------------------------------------------------------------