#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Troop.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #TODO: НЕ, лучше не трогать Game_Troop, так как у нас есть стандартный бой тоже!!!

    # * Через класс Game_Troop мы будем обращаться ко всем АБС врагам (АИ) на карте

    #@[DEFINES]
    _ = Game_Troop::

    
    return
# ■ END Game_Troop.coffee
#---------------------------------------------------------------------------