#╒═════════════════════════════════════════════════════════════════════════╛
# ■ DataManager.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = DataManager

    #TODO: УДАЛИТЬ
    # * Хранит ли предмет (объект) в себе ABS параметры
    _.isHaveABSParams = (item) -> return item?.AASkillData?
    
    return
# ■ END DataManager.coffee
#---------------------------------------------------------------------------