#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Event.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Event::

    # * Система AAEntity
    # -----------------------------------------------------------------------
    do ->

        #TODO: read comment from Page or comment block
        _.aaIsABSEventPage = -> [2, 3, 4].contains(@eventId())

        _._initMembersABS = ->
            @aaEntity = new AAEnemyEntity(@eventId())
            @initABS()

        return
    # -----------------------------------------------------------------------
    
    #TODO: СБРОС ЦЕЛИ
    #TODO: ОФФСЕТ ДЛЯ ВЫБОРА
    #TODO: МИНИ ХП БАР
    # Также добавить управление ним во время игры (один из трёх типов)

    return
# ■ END Game_Event.coffee
#---------------------------------------------------------------------------