#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Map.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Map::

    # * Когда карта загружена, происходит активация ABS событий
    _.initABS = () ->
        e.initABS() for e in @eventsAA()

    # * Все ABS события на карте
    _.eventsAA = () -> @events().filter (e) -> e.isABS()

    # * ABS события в указанной точке
    _.eventsXyAA = (x, y) ->
        try
            return @eventsXy(x, y).filter (e) -> e.isActive()
        catch e
            AA.w e
    
    return
# ■ END Game_Map.coffee
#---------------------------------------------------------------------------