#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Temp.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Temp::

    #@[ALIAS]
    ALIAS__setDestination = _.setDestination
    _.setDestination = ->
        ALIAS__setDestination.call(@, ...arguments)
        # * Восстановить камеру при движении (если опция)
        @aaResetMapScrollOnMoving()
        return
    
    return
# ■ END Game_Temp.coffee
#---------------------------------------------------------------------------