# * Глабольный менеджер с вспомогательными методами для АБС боя

AABattleManager = ->

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ IMPLEMENTATION.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AABattleManager

    # * Может ли user использовать навык aaSkill в данный момент (имея активную цель target или null)
    _.canUseAASkillNow = (user, aaSkill, target) -> true




    return
# ■ END IMPLEMENTATION.coffee
#---------------------------------------------------------------------------