# * Глабольный менеджер с вспомогательными методами для АБС боя

AABattleManager = ->

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ IMPLEMENTATION.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AABattleManager

    #TODO: Не нужен по сути


    return
# ■ END IMPLEMENTATION.coffee
#---------------------------------------------------------------------------