# * Вспомогательные функции проверки данных и настроек АБС
AA.Utils.Guard = ->

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ GUARD.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AA.Utils.Guard

    # * Этот метод проверит, можно ли создать АБС событие с этимм врагом из БД
    _.isProperEnemyIdForABSEvent = (enemyId) ->
        return $dataEnemies[enemyId]? and String.any($dataEnemies[enemyId].name)

    return

# ■ END GUARD.coffee
#---------------------------------------------------------------------------