# * Класс хранит набор АБС навыков (и предметов) для Battler
#@[STORABLE]
class AASkillsSet
    constructor: () ->
        

#╒═════════════════════════════════════════════════════════════════════════╛
# ■ AASkillsSet.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AASkillsSet::


    
    return
# ■ END AASkillsSet.coffee
#---------------------------------------------------------------------------