#╒═════════════════════════════════════════════════════════════════════════╛
# ■ Game_Party.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = Game_Party::

    #TODO: Пока только игрок может быть (АБС)
    #TODO: Добавить игнорирование членов группы с пустыми именами (частая ошибка новичков)
    #@[ALIAS]
    ALIAS__setupStartingMembers = _.setupStartingMembers
    _.setupStartingMembers = ->
        ALIAS__setupStartingMembers.call(@)
        @_actors = [@_actors.first()]
        return
    
    return
# ■ END Game_Party.coffee
#---------------------------------------------------------------------------