# * Класс АБС навыка (дейсвтия), может быть спелл или предмет
# * Новая версия


# * Не требует цели совсем
# * Базируется на 4х основных парметрах


# * Базовое представление
# * 1 Активация, 2 выбор зоны применения, 3 эффект в зоне

#@[STORABLE]
class AASkill2
    constructor: (@databaseId) ->
    
#╒═════════════════════════════════════════════════════════════════════════╛
# ■ AASkill2.coffee
#╒═════════════════════════════════════════════════════════════════════════╛
#---------------------------------------------------------------------------
do ->

    #@[DEFINES]
    _ = AASkill2::



    
    return
# ■ END AASkill2.coffee
#---------------------------------------------------------------------------